УТ_для_edt.РасширениеСмарт/src/Documents/КорректировкаНазначенияТоваров/КорректировкаНазначенияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5bac1b80-f1c2-4ab0-9dbc-8938564087cd">
  <name>КорректировкаНазначенияТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="39a7f699-bbb3-43f2-96bc-c47b86b5f072">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="42bb455c-c7f7-4561-a2ec-57cb8604dca3">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/АналитикаУчетаНоменклатуры/АналитикаУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>АналитикаУчетаНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>КлючАналитики</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>СтатьяКалькуляции</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Назначения/Назначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Назначения</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ДвиженияПоСкладскимРегистрам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтролироватьТолькоНаличие</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Documents/КорректировкаНазначенияТоваров/ObjectModule.bsl
&ИзменениеИКонтроль("ПриЗаписи")
Процедура смарт_ПриЗаписи(Отказ)
	#Вставка
	//++ #5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка
	Если ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.ПроизвольнаяКорректировкаНазначений	Тогда		
		Для Каждого СтрокаТовар Из Товары Цикл
			Если СтрокаТовар.НовоеНазначение.ТипНазначения = Перечисления.ТипыНазначений.смартТоварВыведенныйИзОборота Тогда
				ШаблонНазначения = Документы.КорректировкаНазначенияТоваров.ШаблонНазначения(ЭтотОбъект, СтрокаТовар.НовоеНазначение, СтрокаТовар.Номенклатура, СтрокаТовар.Серия); 
				
				Если ЗначениеЗаполнено(СтрокаТовар.НовоеНазначение.Заказ) И НЕ СтрокаТовар.НовоеНазначение.Заказ = ЭтотОбъект.Ссылка 
					ИЛИ НЕ СтрокаТовар.Номенклатура = СтрокаТовар.НовоеНазначение.смартВыведеннаяИзОборотаНоменклатура
					ИЛИ НЕ СтрокаТовар.Серия = СтрокаТовар.НовоеНазначение.смартВыведеннаяИзОборотаСерия Тогда  
					
					НовоеНазначениеСсылка = Справочники.Назначения.НайтиПоШаблону(ШаблонНазначения);
					Если ЗначениеЗаполнено(НовоеНазначениеСсылка) Тогда
						СтрокаТовар.НовоеНазначение = НовоеНазначениеСсылка;						
					Иначе
						
						//ищем назначение Заказ = Неопределено
						ШаблонНазначенияКопия = Документы.КорректировкаНазначенияТоваров.ШаблонНазначения(ЭтотОбъект, СтрокаТовар.НовоеНазначение, СтрокаТовар.Номенклатура, СтрокаТовар.Серия); 
						ШаблонНазначенияКопия.Заказ = Неопределено;
						
						НовоеНазначениеСсылка = Справочники.Назначения.НайтиПоШаблону(ШаблонНазначенияКопия);
						Если ЗначениеЗаполнено(НовоеНазначениеСсылка) Тогда
							СтрокаТовар.НовоеНазначение = НовоеНазначениеСсылка;						
						Иначе 
							СтрокаТовар.НовоеНазначение = Справочники.Назначения.ПолучитьСсылку();
                        КонецЕсли;						
					КонецЕсли;
				КонецЕсли;
				
				Справочники.Назначения.ПриЗаписиДокумента(СтрокаТовар.НовоеНазначение, ШаблонНазначения, ЭтотОбъект, Неопределено, Неопределено);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//-- #5030 смарт: Тимофеева 02.02.26
	#КонецВставки   										  
КонецПроцедуры

&ИзменениеИКонтроль("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Или ДополнительныеСвойства.Свойство("ПрограммноеСозданиеДокумента") Тогда
		Возврат;
	КонецЕсли;

	ПроверитьПравоПроведенияДокумента(Отказ);

	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	ОбщегоНазначенияУТ.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи);

	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект,
	НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.КорректировкаНазначенияТоваров));

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда

		МестаУчета = РегистрыСведений.АналитикаУчетаНоменклатуры.МестаУчета(Перечисления.ХозяйственныеОперации.КорректировкаОбособленногоУчета, Неопределено, Неопределено, Неопределено);
		ИменаПолей = РегистрыСведений.АналитикаУчетаНоменклатуры.ИменаПолейКоллекцииПоУмолчанию();
		ИменаПолей.Произвольный = "Склад";
		ИменаПолей.Назначение = "ИсходноеНазначение";
		РегистрыСведений.АналитикаУчетаНоменклатуры.ЗаполнитьВКоллекции(Товары, МестаУчета, ИменаПолей);

		ИменаПолей.Назначение = "НовоеНазначение";
		ИменаПолей.АналитикаУчетаНоменклатуры = "АналитикаУчетаНоменклатурыОприходование";
		РегистрыСведений.АналитикаУчетаНоменклатуры.ЗаполнитьВКоллекции(Товары, МестаУчета, ИменаПолей);

		ЗаполнитьВидыЗапасов(Отказ);

	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если Не ВидыЗапасовУказаныВручную Тогда
			ВидыЗапасов.Очистить();
		КонецЕсли;
	КонецЕсли;

	КорректировкаНазначенияТоваровЛокализация.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	#Вставка
	//++ #5798 смарт: Тимофеева 18.02.26 / Выведенные из оборота товары. Представление документа в отчетах
	Если ЭтоВыводИзОборота(Товары.Выгрузить()) Тогда
		ЭтотОбъект.смартОперацияВводаВыводаИзОборота = Перечисления.смартОперацииВводаВыводаТоваровИзОборота.ВыводИзОборота;
	ИначеЕсли ЭтоВводВОборот(Товары.Выгрузить()) Тогда 
		ЭтотОбъект.смартОперацияВводаВыводаИзОборота = Перечисления.смартОперацииВводаВыводаТоваровИзОборота.ВводВОборот;
	Иначе
		ЭтотОбъект.смартОперацияВводаВыводаИзОборота = Перечисления.смартОперацииВводаВыводаТоваровИзОборота.ПустаяСсылка();
	КонецЕсли;
	//-- #5798 смарт: Тимофеева 18.02.26
	#КонецВставки  
КонецПроцедуры 

Функция ЭтоВыводИзОборота(ТаблицаТовары) 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.НовоеНазначение КАК НовоеНазначение,
	|	ТаблицаТовары.ИсходноеНазначение КАК ИсходноеНазначение
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЕСТЬNULL(НовыеНазначения.ТипНазначения, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.смартТоварВыведенныйИзОборота)),
	|	МИНИМУМ(ЕСТЬNULL(НовыеНазначения.ТипНазначения, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.смартТоварВыведенныйИзОборота)),
	|	МАКСИМУМ(ЕСТЬNULL(ИсходныеНазначения.ТипНазначения, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.смартТоварВыведенныйИзОборота))
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК НовыеНазначения
	|		ПО ВТ_Товары.НовоеНазначение = НовыеНазначения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК ИсходныеНазначения
	|		ПО ВТ_Товары.ИсходноеНазначение = ИсходныеНазначения.Ссылка
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ЕСТЬNULL(НовыеНазначения.ТипНазначения, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.смартТоварВыведенныйИзОборота)) И
	|	МИНИМУМ(ЕСТЬNULL(НовыеНазначения.ТипНазначения, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.смартТоварВыведенныйИзОборота)) И
	|	НЕ МАКСИМУМ(ЕСТЬNULL(ИсходныеНазначения.ТипНазначения, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.смартТоварВыведенныйИзОборота))";	
	Запрос.УстановитьПараметр("ТаблицаТовары", ТаблицаТовары); 
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции

Функция ЭтоВводВОборот(ТаблицаТовары) 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.НовоеНазначение КАК НовоеНазначение,
	|	ТаблицаТовары.ИсходноеНазначение КАК ИсходноеНазначение
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЕСТЬNULL(ИсходныеНазначения.ТипНазначения, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.смартТоварВыведенныйИзОборота)),
	|	МИНИМУМ(ЕСТЬNULL(ИсходныеНазначения.ТипНазначения, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.смартТоварВыведенныйИзОборота)),
	|	МАКСИМУМ(ЕСТЬNULL(НовыеНазначения.ТипНазначения, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.смартТоварВыведенныйИзОборота))
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК НовыеНазначения
	|		ПО ВТ_Товары.НовоеНазначение = НовыеНазначения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК ИсходныеНазначения
	|		ПО ВТ_Товары.ИсходноеНазначение = ИсходныеНазначения.Ссылка
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ЕСТЬNULL(ИсходныеНазначения.ТипНазначения, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.смартТоварВыведенныйИзОборота)) И
	|	МИНИМУМ(ЕСТЬNULL(ИсходныеНазначения.ТипНазначения, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.смартТоварВыведенныйИзОборота)) И
	|	НЕ МАКСИМУМ(ЕСТЬNULL(НовыеНазначения.ТипНазначения, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.смартТоварВыведенныйИзОборота))";	
	Запрос.УстановитьПараметр("ТаблицаТовары", ТаблицаТовары); 
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции
